	/**
	 * n - число уравнений (строк матрицы)
	 * c - диагональ, лежащая над главной 
	 * b - главная диагональ матрицы A 
	 * a - диагональ, лежащая под главной 
	 * d - правая часть (столбец)
	 * x - решение, массив x будет содержать ответ
	 */

void sweepMethod (int n, double *a, double *c, double *b, double *d, double *x)
{
	double p[n];
	double q[n];
	
	p[0] = (-c[0])/(b[0]);
	q[0] = (d[0])/[b[0]);
	for (int i = 1; i <= n; i++)
	{
		p[i] = (-c[i-1])/(a[i-1]*p[i-1] + b[i-1]);
		q[i] = (d[i-1) - a[i-1]*q[i-1])/(a[i-1]*p[i-1] + b[i-1]);
	}

	x[n] = (d[n] - a[n]*q[n])/(p[n]*a[n] + b[n]);

	for (int i = n-1; i >= 0; i--)
    {
		x[i]= (x[i+1] * p[i+1]) + q[i+1];
    }
}
